TwoPhaseFlow-master/run/Reorientation/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   staticFvMesh;

solidBodyMotionFvMeshCoeffs
{
    solidBodyMotionFunction oscillatingLinearMotion;
    oscillatingLinearMotionCoeffs
    {
        amplitude       (0.1 0 0);
        omega           3.14;
    }
}


// ************************************************************************* //
