TwoPhaseFlow-master/run/Reorientation/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (phase1 phase2);

phase1
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 6.26e-7;
    rho             rho [ 1 -3 0 0 0 0 0 ] 757.520;

}

phase2
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.259e-5;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1.612;

}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.0153;

surfaceForces
{
  sigma 0.0153;
  surfaceTensionForceModel gradAlpha; // RDF fitParaboloid gradAlpha
  accelerationForceModel gravity;
  deltaFunctionModel alphaCSF;
}


// ************************************************************************* //
