TwoPhaseFlow-master/run/Reorientation/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

touch Reorientierung.foam
runApplication blockMesh
restore0Dir
#runApplication setFields
runApplication setAlphaField
runApplication changeDictionary
runApplication $(getApplication)

#------------------------------------------------------------------------------
