TwoPhaseFlow-master/run/Reorientation/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
restore0Dir
#runApplication setFields
runApplication setAlphaField
runApplication changeDictionary
runApplication decomposePar
runParallel $(getApplication)
runApplication reconstructPar


#------------------------------------------------------------------------------
